ab_500_50_workers.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        uvicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /predict
Document Length:        255 bytes

Concurrency Level:      50
Time taken for tests:   9.183 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      190500 bytes
Total body sent:        115500
HTML transferred:       127500 bytes
Requests per second:    54.45 [#/sec] (mean)
Time per request:       918.261 [ms] (mean)
Time per request:       18.365 [ms] (mean, across all concurrent requests)
Transfer rate:          20.26 [Kbytes/sec] received
                        12.28 kb/s sent
                        32.54 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   2.6      0      11
Processing:    28  875 197.3    880    1345
Waiting:       21  874 197.2    877    1344
Total:         28  876 197.2    880    1345

Percentage of the requests served within a certain time (ms)
  50%    880
  66%    940
  75%    982
  80%   1019
  90%   1097
  95%   1176
  98%   1258
  99%   1312
 100%   1345 (longest request)